// localized port names

"ether"                   = "Ethernet";
"multiether"              = "Ethernet %@";
"pci-ether"               = "Khe Ethernet PCI %@";
"pci-multiether"          = "Khe Ethernet PCI %@, Cổng %@";
"usb-ether"               = "Ethernet USB (%@)";
"generic-ether"           = "Bộ biến đổi Ethernet (%@)";

"airport"                 = "Wi-Fi";
"generic-wireless"        = "Bộ chuyển đổi Mạng Không dây (%@)";

"firewire"                = "FireWire";
"pci-firewire"            = "Khe FireWire PCI %@";
"pci-multifirewire"       = "Khe FireWire PCI %@, Cổng %@";
"generic-firewire"        = "Bộ biến đổi Ethernet (%@)";

"bluetooth"               = "Bluetooth DUN";
"bluetooth-modem"         = "Bộ chuyển đổi Modem Bluetooth USB";
"bluetooth-modem-port"    = "Cổng Modem Bluetooth";
"generic-bluetooth-modem" = "Modem Bluetooth (%@)";

"bluetooth-pan"           = "PAN Bluetooth";

"irda"                    = "IrDA";
"irda-ircomm"             = "Bộ chuyển đổi Modem USB IrDA";
"irda-ircomm-port"        = "Cổng Modem IrDA";

"loopback"                = "Vòng trở lại";

"modem"                   = "Modem Trong";

"modem-port"              = "Cổng Modem";
"modem-printer-port"      = "Cổng Modem/Máy in";

"printer-port"            = "Cổng Máy in";
"serial-port"             = "Cổng Nối tiếp";

"usbmodem"                = "Modem USB"; 
"generic-usbmodem"        = "Modem USB (%@)"; 

"wwan"                    = "WWAN"; 

"bond"                    = "Ghép Ethernet (%@)";

"bridge"                  = "Bridge (%@)";

"vlan"                    = "VLAN (%@)";

"ipv4"                    = "IPv4";

"l2tp"                    = "L2TP";

"pptp"                    = "PPTP";

"6to4"                    = "6to4";

"ipsec"                   = "IPSec";

"vpn"                     = "VPN (%@)";

// port names (from drivers) that would be good to localize

"External Modem"          = "Modem Ngoài";

"USB Ethernet"            = "Ethernet USB";
"USB Gigabit Ethernet"    = "USB Gigabit Ethernet";

"iPhone"                  = "iPhone USB";

// older ("Built-in", HI changed) localizations

"X-airport"               = "AirPort";
"X-ether"                 = "Ethernet Tích hợp sẵn";
"X-multiether"            = "Ethernet Tích hợp %@";
"X-firewire"              = "FireWire Tích hợp sẵn";
"X-bluetooth"             = "Bluetooth";
"X-iPhone"                = "iPhone";
